
// --створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let numbersArray = [9, 8, 7, 6, 5];
// let stringsArray = ['name', 'kokos', 'dobby', 'Nightwish','Lapa'];
// let mixArray = [true, 'Sierj', 23, 'empty', 32];
// let emptyArray = [];
// emptyArray[0] = 'Vasia';
// emptyArray[1] = 'Pietia';
// emptyArray[2] = 'Mila';
// emptyArray[3] = 'Yola';
// emptyArray[4] = 'Kola';
//
// console.log(numbersArray);
// console.log('________________________________________');
// console.log(stringsArray);
// console.log('________________________________________');
// console.log(mixArray);
// console.log('________________________________________');
// console.log(emptyArray);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// let div = `<div>Lorem ipsum dolor sit amet</div>`;
// for (let i = 1; i <= 10; i++) {
//     document.write(i);
//     document.write(div);
//     document.write('<br>');
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// let string = `<div>avadakedabra</div>`;
// for (let i = 1; i < 11; i++) {
//     document.write(i);
//     document.write(string);
//     document.write('______________________');
//     document.write('<br>');
//
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let div = '<div><h1>avadakadabra</h1></div>';
// let i = 1;
// while (i < 21) {
//     document.write(i);
//     document.write(div);
//     document.write('____________________');
//     document.write('<br>');
//     i++;
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let div = '<div><h3>bober zla tvaryna</h3></div>';
// let i = 1;
// while (i <= 20) {
//     document.write(i);
//     document.write(div);
//     document.write('----------------------------');
//     document.write('<br>');
//     i++;
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let numArray = [23, 3, 56, 32, 9, 4,86, 90, 0];
// for (let value of numArray) {
//     document.write(value);
//     document.write('<br>')
// }
// document.write('____________________________');
// document.write('<br>')
//
// for (let i = 0; i < numArray.length; i++) {
//     document.write(numArray[i]);
//     document.write('<br>')
// }
// document.write('____________________________');
// document.write('<br>')
//
// let i = 0;
// while (i < numArray.length) {
//     document.write(numArray[i]);
//     document.write('<br>');
//     i++
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let stringsArray = [
//     'kokos',
//     'morkovka',
//     'ridiska',
//     'baranchik shon',
//     'barbara strange',
//     'knopik',
//     'fiksik',
//     'bobik',
//     'moska',
//     'slon'];
// for (let i = 0; i < stringsArray.length; i++) {
//     console.log(stringsArray[i]);
// }
// console.log('______________________');
// for (let i of stringsArray) {
//     console.log(i)
// }
// console.log('______________________');
// let i = 0;
// while (i < stringsArray.length) {
//     console.log(stringsArray[i]);
//     i++
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let arr = [2, 'kokos', true, 3, 'bro', 98, 34, false, 90, 'baba'];
// for (let i of arr) {
//     console.log(i);
// }
// console.log('_____________');
// let i = 0;
// while (i < arr.length) {
//     console.log(arr[i])
//     i++
// }
// console.log('_____________');
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i])
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки
// булеві елементи
// let arr = [2, 'kokos', true, 3, 'bro', 98, 34, false, 90, 'baba'];
// for (let i of arr) {
//     if (typeof i === "boolean") {
//         console.log(i)
//     }
// }
// console.log('--------------')
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "boolean") {
//         console.log(arr[i])
//     }
// }
// console.log('--------------')
// let i = 0;
// while (i < arr.length) {
//         if (typeof arr[i] === "boolean") {
//         console.log(arr[i])
//     }
//     i++
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки
// числові елементи
// let arr = [2, 'kokos', true, 3, 'bro', 98, 34, false, 90, 'baba'];
// let i = 0;
// while (i < arr.length) {
//     if (typeof arr[i] === "number") {
//         console.log(arr[i])
//     }
//     i++
// }
// console.log('______________')
// for (let i of arr) {
//     if (typeof i === "number") {
//         console.log(i)
//     }
// }
// console.log('______________')
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "number") {
//         console.log(arr[i])
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки
// рядкові елементи
// let arr = [2, 'kokos', true, 3, 'bro', 98, 34, false, 90, 'baba', false, true];
// let i = 0;
// while (i < arr.length) {
//     if (typeof arr[i] === "string") {
//         console.log(arr[i]);
//     }
//     i++
// }
// console.log('__________');
// for (let string of arr) {
//     if (typeof string === "string") {
//         console.log(string)
//     }
// }
// console.log('__________');
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "string") {
//         console.log(arr[i])
//     }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
let emptyArr = [];
emptyArr[0] = ('elf');
emptyArr[1] = (true);
emptyArr[2] = (44);
emptyArr[3] = ('dwarf');
emptyArr[4] = (55);
emptyArr[5] = (false);
emptyArr[6] =('dart weider');
emptyArr[7] =(false);
emptyArr[8] =(99);
emptyArr[9] =(10);
for (let i of emptyArr) {
    console.log(i)
}

let i = 0;
while (i < emptyArr.length) {

}


// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1
// створити пустий масив та :
//     1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// 2. вывести на консоль  каждый третий елемент
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
//
//
